pressure_tests_results/wo_redis_random_files_3.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 355 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 786 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1192 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1629 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2029 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2405 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2848 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3256 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3711 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4152 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4575 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 4976 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5424 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 5838 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6265 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6702 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7149 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7591 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8031 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8460 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8512 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 90 MB/s
     data_sent......................: 1.1 MB 54 kB/s
     http_req_blocked...............: avg=12.03µs  min=0s       med=1µs      max=2.83ms   p(90)=3µs     p(95)=4µs     
     http_req_connecting............: avg=7.05µs   min=0s       med=0s       max=1.37ms   p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=17.47ms  min=169µs    med=13.91ms  max=125.24ms p(90)=36.55ms p(95)=47.16ms 
       { expected_response:true }...: avg=17.76ms  min=169µs    med=14.32ms  max=125.24ms p(90)=36.81ms p(95)=47.3ms  
     http_req_failed................: 12.59% ✓ 1072       ✗ 7440
     http_req_receiving.............: avg=220.69µs min=6µs      med=41µs     max=100.34ms p(90)=130µs   p(95)=160µs   
     http_req_sending...............: avg=8.98µs   min=2µs      med=4µs      max=11.07ms  p(90)=11µs    p(95)=18µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=17.24ms  min=154µs    med=13.82ms  max=111.41ms p(90)=36.26ms p(95)=46.57ms 
     http_reqs......................: 8512   423.420738/s
     iteration_duration.............: avg=117.79ms min=100.22ms med=114.15ms max=227.51ms p(90)=136.9ms p(95)=147.51ms
     iterations.....................: 8512   423.420738/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50