pressure_tests_results/wo_redis_random_files_4.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 357 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 785 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1191 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1609 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2045 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2486 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2933 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3387 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3831 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4270 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4708 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5140 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5581 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 6020 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6447 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6887 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7310 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7749 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8192 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8654 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8706 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.9 GB 92 MB/s
     data_sent......................: 1.1 MB 55 kB/s
     http_req_blocked...............: avg=11.21µs  min=0s       med=1µs      max=2.75ms   p(90)=2µs      p(95)=3µs     
     http_req_connecting............: avg=7.01µs   min=0s       med=0s       max=1.47ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=14.85ms  min=172µs    med=12.22ms  max=98.04ms  p(90)=30.95ms  p(95)=36.61ms 
       { expected_response:true }...: avg=15.03ms  min=172µs    med=12.55ms  max=98.04ms  p(90)=31.13ms  p(95)=36.77ms 
     http_req_failed................: 12.52% ✓ 1090       ✗ 7616
     http_req_receiving.............: avg=171.36µs min=6µs      med=31µs     max=83.9ms   p(90)=123µs    p(95)=164µs   
     http_req_sending...............: avg=5.65µs   min=2µs      med=4µs      max=1.14ms   p(90)=9µs      p(95)=12µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=14.67ms  min=159µs    med=12.15ms  max=95.94ms  p(90)=30.63ms  p(95)=36.32ms 
     http_reqs......................: 8706   433.182539/s
     iteration_duration.............: avg=115.14ms min=100.23ms med=112.53ms max=201.76ms p(90)=131.28ms p(95)=137.08ms
     iterations.....................: 8706   433.182539/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50